# sw 역량 테스트 준비 - 기초
blocks = (
    ((0, 1), (0, 2), (0, 3)),
    ((1, 0), (2, 0), (3, 0)),
    ((0, 1), (1, 0), (1, 1)),
    ((1, 0), (2, 0), (2, 1)),
    ((0, 1), (0, 2), (1, 0)),
    ((0, 1), (1, 1), (2, 1)),
    ((0, 1), (0, 2), (-1, 2)),
    ((0, 1), (0, 2), (1, 2)),
    ((1, 0), (2, 0), (0, 1)),
    ((0, 1), (-1, 1), (-2, 1)),
    ((1, 0), (1, 1), (1, 2)),
    ((1, 0), (1, 1), (2, 0)),
    ((-1, 1), (0, 1), (1, 1)),
    ((0, 1), (0, 2), (1, 1)),
    ((0, 1), (-1, 1), (0, 2)),
    ((1, 0), (1, 1), (2, 1)),
    ((1, 0), (0, 1), (-1, 1)),
    ((0, 1), (-1, 1), (-1, 2)),
    ((0, 1), (1, 1), (1, 2)),
)
n, m = map(int, input().split())
a = [list(map(int, input().split())) for _ in range(n)]
ans = 0
for x in range(n):
    for y in range(m):
        for block in blocks:
            ok = True
            s = a[x][y]
            for dx, dy in block:
                nx, ny = x+dx, y+dy
                if 0 <= nx < n and 0 <= ny < m:
                    s += a[nx][ny]
                else:
                    ok = False
                    break
            if ok and ans < s:
                ans = s
print(ans)